"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
all_sales = [
{'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
{'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
{'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
]
   
    
def sales_count(mobile_score):
	scores_sum = 0
	for score in mobile_score:
		scores_sum += score
	return scores_sum/len(mobile_score)



for sale_one in all_sales:
	sale_one['items_sold']
	print(sale_one)

mobile_avg_sum = 0
for one_sale in all_sales:
	sale_avg = sales_count(one_sale['items_sold'])
	print(f'среднее количество продаж для {one_sale["product"]}: {sale_avg}')
	mobile_avg_sum += sale_avg



mobile_avg = mobile_avg_sum / len(all_sales)
print(f'среднее количество продаж всех товаров: {mobile_avg}')


	

if __name__ == "__main__":
    main()
